// 基础的七种方块
export {
    s1, s2, s3, s4, s5, s6, special
}

/**
 * 一次性返回全部方块
 * @returns 全部的方块
 */
const special = (): number[][][] => [s1, s2, s3, s4, s5, s6, s7, s8, s9, s10, s11]

const s1 = [[1, 0, 1]]
const s2 = [[1, 0], [0, 1]]
const s3 = [[0, 0, 1], [0, 1, 0], [1, 0, 0]]
const s4 = [[1, 0, 1], [1, 0, 1]]
const s5 = [[0, 1, 0], [1, 1, 1], [0, 1, 0]]
const s6 = [[1, 1, 1], [1, 0, 1]]
const s7 = [[1, 1, 1], [1, 1, 1]]
const s8 = [[1, 1, 1], [1, 1, 1], [1, 1, 1]]
const s9 = [[1, 1, 1], [1, 0, 0], [1, 0, 0]]
const s10 = [[1, 1, 1], [0, 1, 0], [0, 1, 0]]
const s11 = [[1, 1], [1, 1], [1, 1], [1, 1]]